Hello so I re-run again and this is the operation where it fails:

```bash
resource "azurerm_role_assignment" "allow_connection_to_read" {
  scope                = var.acr["id"]
  # Built in azure role
  role_definition_name = "Reader"
  principal_id         = azuredevops_serviceendpoint_azurecr.this.service_principal_id
}
```

The plan looks like this:

```
 module.azure_devops["backend"].azurerm_role_assignment.allow_connection_to_push must be replaced
-/+ resource "azurerm_role_assignment" "allow_connection_to_push" {
      ~ id                               = "/subscriptions/XXXX/resourceGroups/global-rg/providers/Microsoft.ContainerRegistry/registries/My ACR/providers/Microsoft.Authorization/roleAssignments/50bece16-452f-206d-6a95-db090a6b8c71" -> (known after apply)
      ~ name                             = "50bece16-452f-206d-6a95-db090a6b8c71" -> (known after apply)
      ~ principal_id                     = "AN_ID" -> "TOANOTHERID" # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/XXXXXX/providers/Microsoft.Authorization/roleDefinitions/8311e382-0749-4cb8-b61a-304f252e45ec" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }
 ```
 
 This means that is trying to change the service principal IDs to the ones created by azuredevops_serviceendpoint_azurecr and allow them to do operations in the Docker Registry (ACR)
 
 The timeout of the azurerm_role_assignment is 30 minutes so it runs for about 30 minutes and then it timeouts.
 
 So I was reading about azurerm_role_assignment and it does some service_principal checks as stated in the documentation: https://registry.terraform.io/providers/hashicorp/azurerm/latest/docs/resources/role_assignment#skip_service_principal_aad_check
 
 It says that azurerm_role_assignment does some checks in the service principal (it doesn't mention which). So I decided to disable the checks by doing
 
 ```bash
resource "azurerm_role_assignment" "allow_connection_to_read" {
  scope                = var.acr["id"]
  # Built in azure role
  role_definition_name = "Reader"
  skip_service_principal_aad_check = true
  principal_id         = azuredevops_serviceendpoint_azurecr.this.service_principal_id
}
```
 
 Now it works. So I am guessing that the service id created by azuredevops_serviceendpoint_azurecr is not passing the checks for  azurerm_role_assignment.  I wonder what this checks are... maybe azuredevops_serviceendpoint_azurecr needs to do additional stuff in order to pass the checks.
 
 I was reading about this check and it seems to be a problem from  azurerm_role_assignment not yours maybe but I am not sure.
 